# HighlightedElementDisconnected Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..AutoRouteFailures..::..HighlightedElementDisconnected Property
BuiltInFailures..::..AutoRouteFailures Class See Also
---
The highlighted element has been disconnected.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId HighlightedElementDisconnected { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property HighlightedElementDisconnected As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ HighlightedElementDisconnected {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..AutoRouteFailures Class
Autodesk.Revit.DB Namespace